# taps

tap 'homebrew/bundle'
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'neovim/neovim'
tap 'facebook/fb'
tap 'NicholasTD07/lychee-gold'

# essential

brew 'mas' # cli for Mac App Store

# casks

## apps

cask 'opera'
cask 'macid'
cask 'nvalt'
cask 'sketch'
cask 'google-drive'

# drivers

cask 'scansnap-manager' # for ScanSnap S1300i

## devtools

cask 'iterm2'
cask 'NicholasTD07/lychee-gold/dash' # v2
cask 'reveal'
cask 'paw'

## ios

cask 'zeplin'

## fonts

cask 'font-inconsolata-g-for-powerline' # disable iTerm thinner font on Retina

## utils

cask 'alfred'
cask 'bartender'
cask 'caffeine'
cask 'dropbox'

cask 'flux'
cask 'istat-menus'
cask 'moom'

cask 'gfxCardStatus' # for work laptop
cask 'karabiner'     # for Kinesis Advantage

## games

cask 'minecraft'

# mas

## essential

mas '1Password', id: 443987910
mas 'Day One', id: 1055511498
mas 'DaisyDisk', id: 411643860

## utils

mas 'Brainwave Studio', id: 548229245

mas 'Pages', id: 409201541
mas 'Keynote', id: 409183694

mas 'Disk Care', id: 913724705

## iOS

mas 'GIPHY CAPTURE', id: 668208984

## social

mas 'Tweetbot for Twitter', id: 557168941

## games

mas 'Mini Metro', id: 1047760200 # Resource planning game

# brews

## core

brew 'fish'
brew 'git'
brew 'git-lfs'

### lang

brew 'python'
brew 'python3' # httpie
brew 'ruby'
brew 'haskell-stack'

brew 'neovim'

## utils

brew 'thefuck'
brew 'fzf'       # fuzzy finder
brew 'ctags'

brew 'httpie'

brew 'coreutils' # gln for relative symlink
brew 'tree'
brew 'ripgrep'
brew 'aria2'

## iOS

brew 'carthage'
brew 'swiftlint'
brew 'fbsimctl' #, args: ['HEAD'] # facebook's open source simulator control tool

## make tools

brew 'autoconf'
brew 'automake'
brew 'pkg-config'

## dependencies

brew 'openssl'       # python python3 ruby
brew 'readline'      # python python3 ruby
brew 'gdbm'          # python python3
brew 'xz'            # python3 the_silver_searcher
brew 'pcre'          # the_silver_searcher
brew 'sqlite'        # python
brew 'libyaml'       # ruby
brew 'pcre2'         # fish
brew 'cmake'         # plugin YCM needs it
brew 'ghc'           # haskell
brew 'cabal-install' # haskell

brew 'libtool'       # neovim
brew 'libuv'         # neovim
brew 'msgpack'       # neovim
brew 'unibilium'     # neovim
brew 'libtermkey'    # neovim
brew 'libvterm'      # neovim
brew 'gettext'       # neovim
brew 'jemalloc'      # neovim
