# taps

tap 'homebrew/bundle'
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'neovim/neovim'

# essential

brew 'mas' # cli for Mac App Store

# casks

## apps

cask 'google-chrome'
cask 'macid'
cask 'nvalt'
cask 'sketch'
cask 'google-drive'
cask 'scansnap-manager' # for ScanSnap S1300i

## devtools

cask 'iterm2'
cask 'dash'
cask 'reveal'
cask 'paw'
cask 'zeplin'

### trailing

cask 'Kaleidoscope'

## fonts

cask 'font-inconsolata-g-for-powerline' # disable iTerm thinner font on Retina

## utils

cask 'alfred'
cask 'bartender'
cask 'caffeine'
cask 'dropbox'

cask 'flux'
cask 'istat-menus'
cask 'moom'

cask 'gfxCardStatus' # for work laptop
cask 'karabiner' # for Kinesis Advantage

# apps from mas

mas '1Password', id: 443987910
mas 'Day One', id: 1055511498

mas 'Brainwave Studio', id: 548229245
# mas 'Billings Pro', id: 434514810

mas 'Pages', id: 409201541
mas 'Keynote', id: 409183694

mas 'Disk Care', id: 913724705
mas 'DaisyDisk', id: 411643860

mas 'WeChat', id: 836500024
mas 'QQ', id: 451108668

mas 'GIPHY CAPTURE', id: 668208984

mas 'Mini Metro', id: 1047760200 # Resource planning game

# brews

## brew tools

brew 'autoconf'
brew 'automake'
brew 'pkg-config'

## core

brew 'fish'
brew 'git'
brew 'git-lfs'

### lang (needed by vim)

brew 'python'
brew 'python3'
brew 'ruby'
brew 'haskell-stack'

brew 'vim', args: ['without-perl']
brew 'neovim'

## utils

brew 'thefuck'
brew 'fzf' # fuzzy finder

brew 'coreutils' # gln for relative symlink
brew 'tree'
brew 'the_silver_searcher'
brew 'aria2'

## iOS

brew 'carthage'
brew 'swiftlint'

## dependencies

brew 'openssl' # python python3 ruby
brew 'readline' # python python3 ruby
brew 'gdbm' # python python3
brew 'xz' # python3 the_silver_searcher
brew 'pcre' # the_silver_searcher
brew 'sqlite' # python
brew 'libyaml' # ruby
brew 'pcre2' # fish
brew 'cmake' # plugin YCM needs it
brew 'ghc' # haskell
brew 'cabal-install' # haskell

brew 'libtool' # neovim
brew 'libuv' # neovim
brew 'msgpack' # neovim
brew 'unibilium' # neovim
brew 'libtermkey' # neovim
brew 'libvterm' # neovim
brew 'gettext' # neovim
brew 'jemalloc' # neovim
