# taps

tap 'homebrew/bundle'
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'neovim/neovim'
tap 'facebook/fb'
tap 'd12frosted/emacs-plus'
tap 'caskroom/drivers'

# essential

brew 'mas' # cli for Mac App Store

# casks

## apps

cask 'google-chrome' # bloody hangout
cask 'firefox'
cask 'franz'
cask 'macid'
cask 'nvalt'
cask 'sketch'
cask 'google-drive'
cask 'google-drive-file-stream'

# drivers

cask 'scansnap-manager' # for ScanSnap S1300i
cask 'kensington-trackball-works' # for Kensington Trackballs
cask 'evoluent-vertical-mouse-device-controller'


## devtools

cask 'iterm2'
cask 'reveal'
cask 'paw'
cask 'charles'

## ios

cask 'zeplin'

## fonts

cask 'font-inconsolata-g-for-powerline' # disable iTerm thinner font on Retina
cask 'font-source-code-pro'
cask 'font-source-code-pro-for-powerline'

## utils

cask 'alfred'
cask 'bartender'
cask 'caffeine'
cask 'dropbox'

cask 'istat-menus'
cask 'moom'

cask 'gfxCardStatus' # for work laptop

cask 'squirrel'

## virtual machine environments

cask 'virtualbox'
cask 'vagrant'

# mas

## essential

mas '1Password', id: 443987910
mas 'Day One', id: 1055511498
mas 'DaisyDisk', id: 411643860
# mas '1Keyboard', id:766939888

## utils

mas 'Pages', id: 409201541
mas 'Keynote', id: 409183694

mas 'Disk Care', id: 913724705

## iOS

mas 'GIPHY CAPTURE', id: 668208984

## social

# mas 'Tweetbot for Twitter', id: 557168941

## games

mas 'Mini Metro', id: 1047760200 # Resource planning game

# brews

## core

brew 'fish'
brew 'git'
brew 'git-lfs'

brew 'd12frosted/emacs-plus/emacs-plus'
brew 'neovim'

brew 'gpg'

### lang

brew 'python'
brew 'python3' # httpie
brew 'ruby'
brew 'npm'
# brew 'haskell-stack'

## utils

brew 'ctags'
brew 'cdiff'

brew 'global', args: [
       "--with-ctags", # neovim still needs ctags
       "--with-pygments",
     ]

brew 'httpie'

brew 'coreutils' # gln for relative symlink
brew 'tree'
brew 'ripgrep'
brew 'aria2'
brew 'mosh'

brew 'ispell' # for emacs spell check

## iOS

brew 'carthage'
brew 'swiftlint'
brew 'swiftplate', args: ['HEAD']
brew 'chisel'

# brew 'fbsimctl' #, args: ['HEAD'] # facebook's open source simulator control tool

## make tools

brew 'autoconf'
brew 'automake'
brew 'pkg-config'

## dependencies

brew 'openssl'       # python python3 ruby
brew 'readline'      # python python3 ruby
brew 'gdbm'          # python python3
brew 'xz'            # python3 the_silver_searcher
brew 'pcre'          # the_silver_searcher
brew 'sqlite'        # python
brew 'libyaml'       # ruby
brew 'pcre2'         # fish
brew 'cmake'         # plugin YCM needs it
# brew 'ghc'           # haskell
brew 'cabal-install' # haskell

brew 'libtool'       # neovim
brew 'libuv'         # neovim
brew 'msgpack'       # neovim
brew 'unibilium'     # neovim
brew 'libtermkey'    # neovim
brew 'libvterm'      # neovim
brew 'gettext'       # neovim
brew 'jemalloc'      # neovim

brew 'icu4c'         # npm
